[
  {
    "title": "Soool",
    "date": ["2025.04", "~", "진행 중"],
    "tags": ["2인 팀", "사이드 프로젝트", "반응형", "확장성"],
    "color": "#FBE7D4",
    "git": "https://github.com/somedding6363/soool_wine_fe",
    "summary": [
      "술의 다양한 정보를 제공하는 웹서비스를 제작하는 프로젝트입니다.",
      "1명의 백엔드 개발자와 2인 팀을 이루어 작업하고 있습니다.",
      "React와 TypeScript를 사용하고 있으며, Tailwind CSS를 통해 스타일링하고 있습니다.",
      "좋아요 기능에서 서버와 api 통신을 하는 과정에서 사용자 경험을 높이기 위해 Optimistic Update를 채택했습니다.",
      "기존 무분별하게 짰던 코드를 구조적으로 재설계하고, 커스텀훅을 효율적으로 생성해 컴포넌트를 역할에 따라 명확히 분리했습니다."
    ],
    "introduce": [
      "술의 다양한 정보를 제공하는 웹서비스를 제작하는 프로젝트입니다.",
      "현재 와인을 타겟으로 진행하고 있으며(Soool with wine), 다른 주종으로 확장할 예정입니다."
    ],
    "goal": [
      "많은 사용자들이 즐기고 싶거나, 즐겼던 술을 검색하고, 저장하고, 추억을 기록하는 웹서비스가 되는 것이 목표입니다."
    ],
    "feature": [
      "와인의 정보를 조회할 수 있습니다.",
      "와인 별로 글을 작성하여 추억을 기록하거나 메모할 수 있습니다.",
      "현재 위치를 기준으로 주변에 있는 와인 판매점을 보여줍니다."
    ],
    "role": [
      [
        "기획",
        "모든 팀원이 함께 기획을 진행했습니다.\n\n프로젝트의 목표와 부합할 수 있는 기능을 기획하고자 했으며 사용자 입장에서 필요한 기능과 사용 흐름을 고려하여 주요 기능들을 결정했습니다."
      ],
      [
        "디자인",
        "Figma를 통해 초기 디자인을 그렸으며, 디자이너 없이 작업을 해야했기에 코드를 작성하면서 사용자 경험을 생각하며 주기적으로 디자인을 수정했습니다."
      ],
      [
        "프론트엔드 개발",
        "혼자 프론트엔드 개발을 진행하여 모든 페이지를 담당했습니다.\n\n프론트엔드 개발자로서 TypeScript와 React를 사용하여 사용자 인터페이스와 사용자 경험을 최적화하는 데 중점을 두고 프로젝트를 진행했습니다.\n\n또한, 백엔드와 상호작용을 할 수 있도록 Axios를 통해 API 통신을 구현하고 React Query로 데이터를 효율적으로 관리했습니다.\n\n다양한 브라우저와 디바이스에서 테스트하여 모든 사용자에게 최적의 경험을 제공할 수 있도록 했습니다."
      ]
    ],
    "tech": [
      [
        "React, TypeScript",
        "컴포넌트 기반 아키텍처를 통해 UI를 독립적이고 재사용 가능한 조각들로 분리할 수 있어서 개발 속도를 높일 수 있기에 React를 사용했습니다. 또한 코드의 안정성을 크게 향상시키는 TypeScript를 사용해서 타입 관련 오류를 미리 발견해서 예상치 못한 버그를 방지할 수 있습니다."
      ],
      [
        "React Router",
        "프로젝트에서 여러 페이지를 구현하고, 페이지 간의 전환을 원활하게 처리하기 위해 React Router를 사용했습니다.\n\n서버에서 라우팅하는 것이 아닌 클라이언트에서 라우팅을 관리하여 매끄러운 페이지 이동으로 사용자 경험을 개선하고 성능을 최적화할 수 있습니다."
      ],
      [
        "React Query",
        "데이터를 효율적으로 관리하기 위해 React Query를 사용했습니다. 일반적으로 서버와 통신을 하면 useEffect와 useState를 조합해서 구현하는 경우가 많았습니다. 이는 데이터 로딩, 에러 처리 등을 직접 관리해야 했기에 코드가 많이 복잡해졌습니다. 이에 React Query를 도입하여 서버 상태를 손쉽게 관리할 수 있는 훅을 이용했습니다."
      ],
      [
        "Zustand",
        "로그인 한 사용자의 상태를 관리하기 위해 Zustand를 도입했습니다.\n\n다른 라이브러리에 비해 API가 단순하며, 복잡한 코드나 wrapper를 사용하지 않고도 상태를 쉽게 정의하고 업데이트할 수 있습니다."
      ],
      [
        "Axios",
        "백엔드와 HTTP 통신을 진행할 때, Axios와 Fetch 중 Axios를 선택했습니다. Axios는 Fetch와 달리 자동으로 JSON 데이터를 파싱할 수 있어 코드가 더 간결하고 직관적이며, HTTP 에러를 자동으로 감지하고 catch 블록에서 처리할 수 있기 때문에 에러 핸들링이 더 용이합니다."
      ],
      [
        "Tailwind CSS",
        "Utility-first 방식을 통해 직접 작성하는 대신 미리 정의된 클래스를 조합해서 빠르고 효율적으로 스타일을 적용할 수 있어서 Tailwind CSS를 사용했습니다. 반응형 디자인을 쉽게 구현할 수 있고, 여러 클래스들을 묶어서 사용자 정의 커스텀이 가능했기에 스타일링을 빠르게 적용할 수 있습니다."
      ]
    ]
  },
  {
    "title": "Kuphil Web",
    "date": ["2021.12", "~", "2024.05"],
    "tags": ["4인 팀", "사이드 프로젝트", "반응형", "리뉴얼"],
    "color": "#FBE7D4",
    "link": "https://www.kuphil.com",
    "git": "https://github.com/Choiheeju59/kuphilweb_v2",
    "summary": [
      "교내 오케스트라 동아리 웹사이트로, 자발적으로 진행한 프로젝트입니다.",
      "1차 배포 후 사용자 평가를 바탕으로 리뉴얼과 유지보수를 진행했습니다.",
      "팀장으로서 기획, 개발, 배포를 총괄하며 원활한 협업을 이끌었습니다.",
      "초기에는 HTML, CSS, JavaScript로 SSR 방식의 개발을 진행했으며, 이후 React를 도입해 CSR 방식으로 리뉴얼했습니다.",
      "위키피디아 이미지를 사용하는 이상형 월드컵 콘텐츠에서 이미지 로딩 지연 문제가 발생해, 미리 로딩과 로딩 UI 도입을 통해 사용자 경험을 크게 개선했습니다."
    ],
    "introduce": [
      "교내 오케스트라 동아리 웹사이트를 제작하는 프로젝트입니다.",
      "동아리에 소속감을 느껴서 활성화를 위해 동아리 단원 4명을 모아 자발적으로 진행했습니다.",
      "2023년 5월에 웹사이트를 배포한 후, 사용자들을 대상으로 설문을 진행하고 특정 사용자를 대상으로 실제 웹 사이트에서의 경험을 분석하여 사용자 평가를 진행했습니다.",
      "사용자 평가를 바탕으로 리뉴얼과 유지보수를 하여 2024년 5월에 프로젝트를 완료했습니다."
    ],
    "goal": [
      "동아리의 정보를 제공하고 클래식과 가까워지기 위한 즐길 거리를 통해 궁극적으로는 동아리 홍보가 잘 될 수 있도록 하는 것입니다.",
      "리뉴얼을 진행한 이후, 현재는 동아리 임원과의 지속적인 소통을 통한 홈페이지의 발전을 새로운 목표로 삼았습니다."
    ],
    "feature": [
      "동아리 소개 및 연혁 정보를 확인할 수 있습니다.",
      "역대 연주회 정보를 담고 있는 아카이브를 제공합니다.",
      "신입 단원 모집 글과 제휴 정보를 확인할 수 있습니다.",
      "서비스 내의 즐길 거리(클래식과 결합한 심리테스트, 클래식 이상형 월드컵, 클래식 능력고사)를 통해 클래식에 거리낌 없이 다가갈 수 있습니다."
    ],
    "role": [
      [
        "팀장",
        "팀장 역할을 맡아 팀을 이끌며 프로젝트의 기획, 개발 및 배포를 성공적으로 관리했습니다.\n\n기획 단계에서 팀원들 간에 프로젝트의 방향성과 주요 기능에 대한 의견 차이로 인한 갈등, 개발 단계에서 충분한 소통이 없는 코드 수정으로 인한 갈등이 존재했습니다. 팀장으로서 모든 팀원의 의견을 경청하고, 논의를 통해 방향성을 확실시했습니다. 또한, 회의를 통해 코드 수정 전 컨펌을 의무화하는 방안을 채택하여 소통이 이루어질 수 있도록 했습니다."
      ],
      [
        "기획 및 디자인",
        "모든 팀원이 함께 기획과 디자인을 진행했습니다.\n\n프로젝트의 목표와 부합할 수 있는 기능을 기획하고자 했으며 사용자 입장에서 필요한 기능과 사용 흐름을 고려하여 주요 기능들을 결정했습니다. 사용자 피드백을 반영해 기능 우선순위를 조정하고, 사용자 요구를 충족할 수 있는 방향으로 기획을 수정해 나갔습니다. 이를 통해 최종적으로 프로젝트의 방향성을 명확히 했습니다.\n\n디자인 단계에서는 사용자 경험을 최우선으로 고려하여 직관적이고 시각적으로 매력적인 인터페이스를 개발했습니다. 또한 다양한 디바이스에서 일관된 사용자 경험을 보장하기 위해 반응형 디자인을 구현했습니다."
      ],
      [
        "프론트엔드 개발",
        "메인 페이지를 포함하여 신입 단원 모집 및 제휴 제안 페이지를 담당하고, 악기를 이용한 심리테스트, 클래식 이상형 월드컵, 클래식 능력고사 콘텐츠를 개발했습니다.\n\n프론트엔드 개발자로서 JavaScript와 React를 사용하여 사용자 인터페이스와 사용자 경험을 최적화하는 데 중점을 두고 프로젝트를 진행했습니다. 컴포넌트를 모듈화하여 유지보수성과 재사용성을 높였으며, React Router를 통해 애플리케이션 내의 페이지 전환을 원활하게 구현했습니다.\n\n또한, 데이터와 상호작용을 할 수 있도록 Axios를 통해 API 통신을 구현하고, 다양한 브라우저와 디바이스에서 테스트하여 모든 사용자에게 최적의 경험을 제공할 수 있도록 했습니다."
      ],
      [
        "배포 및 사용자 평가",
        "AWS를 통해 프로젝트를 배포하여 안정적인 환경에서 서비스를 제공했습니다. 첫 번째 버전에서는 Node.js의 Express를 사용하여 백엔드 서버와 전체 파일을 배포했습니다. 두 번째 버전에서는 Node.js의 Express를 통해 백엔드 API를 배포하고, NGINX를 사용하여 프론트엔드의 정적 파일을 서빙했습니다.\n\n첫 번째 버전을 배포한 후, 온라인 설문과 대면 인터뷰를 통해 사용자 평가를 진행하여 사용자의 요구와 문제점을 파악했습니다. 이를 바탕으로 개선 사항을 도출하여 두 번째 버전으로 리뉴얼했습니다."
      ]
    ],
    "tech": [
      [
        "ver.1) HTML, CSS, JavaScript",
        "React, Vue, Angular 등의 프레임워크와 라이브러리는 자바스크립트로 구축되었으며, 자바스크립트의 명확한 이해가 뒷받침되어야 했습니다. 자바스크립트의 기본 개념과 문법을 강화하기 위해 이런 라이브러리나 프레임워크를 사용하지 않고 웹 사이트를 제작했습니다."
      ],
      [
        "Node.js",
        "백엔드는 프론트엔드와 비슷하게 자바스크립트를 이용할 수 있는 Node.js를 사용하게 됐습니다."
      ],
      [
        "ver.2) JavaScript, React",
        "버전 1을 구현하면서 헤더와 푸터를 비롯해 재사용할 수 있는 컴포넌트의 필요성을 많이 느끼게 되었습니다. 또한, 여러 기능이 추가되면서 상태 변화에 따라 UI를 효율적으로 업데이트하여 매끄럽고 반응성 있는 UI가 필요했기 때문에 자바스크립트와 함께 리액트를 사용하기로 했습니다."
      ],
      [
        "React Router",
        "프로젝트에서 여러 페이지를 구현하고, 페이지 간의 전환을 원활하게 처리하기 위해 React Router를 사용했습니다.\n\n서버에서 라우팅하는 것이 아닌 클라이언트에서 라우팅을 관리하여 매끄러운 페이지 이동으로 사용자 경험을 개선하고 성능을 최적화할 수 있습니다."
      ],
      [
        "Axios",
        "백엔드와 HTTP 통신을 진행할 때, Axios와 Fetch 중 Axios를 선택했습니다. Axios는 Fetch와 달리 자동으로 JSON 데이터를 파싱할 수 있어 코드가 더 간결하고 직관적이며, HTTP 에러를 자동으로 감지하고 catch 블록에서 처리할 수 있기 때문에 에러 핸들링이 더 용이합니다."
      ],
      [
        "Styled-components",
        "Styled-components는 리액트의 컴포넌트 기반 아키텍처를 따르기 때문에 리액트와 같은 위치에서 스타일을 관리할 수 있습니다. 또한, 리액트의 props를 사용하여 스타일링하는 것이 용이했기에 상태에 따라 스타일을 쉽게 변경할 수 있습니다."
      ],
      [
        "NGINX",
        "리액트로 빌드된 애플리케이션은 정적 파일(HTML, CSS, JavaScript)로 변환되므로, NGINX는 이 파일들을 빠르고 효율적으로 서빙하는 데 최적화되어 있습니다. 또한, NGINX는 리버스 프록시로 작동할 수 있어 클라이언트 요청을 백엔드의 Express 서버로 전달하고, 백엔드로부터 받은 응답을 클라이언트에게 반환할 수 있습니다."
      ]
    ]
  },
  {
    "title": "Color, me",
    "date": ["2023.11"],
    "tags": ["개인", "토이 프로젝트", "포팅"],
    "color": "#e0e0e0",
    "link": "https://chromewebstore.google.com/detail/ldcmnbbjcbciolddfffpfghlcgnogacp?hl=ko&utm_source=ext_sidebar",
    "git": "https://github.com/somedding6363/ColorMe",
    "summary": [
      "원하는 색상 조합을 저장할 수 있는 웹 서비스를 제작했습니다.",
      "GitHub Pages로 1차 배포 후, 접근성을 고려해 크롬 익스텐션으로 버전 2를 배포했습니다.",
      "사용자는 색상을 선택하고 조합을 저장하며, 편집 및 삭제할 수 있습니다.",
      "HTML, CSS, JavaScript만으로 구현하여 가벼운 서비스로 개발했습니다.",
      "간단한 색상 데이터를 저장하기 위해 GitHub Pages에서는 localStorage, Chrome Extension에서는 chrome.storage.local을 선택해 프로젝트 특성과 저장소의 특성을 고려한 최적의 저장 방식을 결정했습니다."
    ],
    "introduce": [
      "원하는 색상 조합을 웹에 저장할 수 있는 웹서비스를 제작하는 프로젝트입니다.",
      "GitHub Pages로 배포했지만, 크롬 익스텐션 프로그램으로 생성하면 접근성이 쉬울 것으로 생각했습니다. 이에 버전 2를 만들어 크롬 익스텐션을 통해 배포했습니다."
    ],
    "goal": [
      "원하는 색상을 골라서 조합 및 저장하는 기능을 제공하여, 디자인이나 인테리어를 진행할 때 색 조합을 편리하게 다룰 수 있도록 하는 것입니다."
    ],
    "feature": [
      "색상을 선택할 수 있으며 해당 색상 배열을 조정할 수 있습니다.",
      "선택한 색상 조합을 저장할 수 있습니다.",
      "저장된 조합을 편집하거나 삭제할 수 있습니다."
    ],
    "tech": [
      [
        "ver.1) HTML, CSS, JavaScript",
        "색상을 조합하는 웹은 간단한 HTML과 CSS, JavaScript를 통해 구현할 수 있었습니다. 그래서 색상을 선택할 수 있는 라이브러리를 제외하고는 별도의 라이브러리나 프레임워크를 사용하지 않고 구현을 진행했습니다."
      ],
      [
        "ver.1) GitHub Pages",
        "정적 웹사이트를 무료로 호스팅할 수 있는 서비스인 Github Pages를 통해 배포를 진행했습니다.\n\nGitHub Pages는 별도의 배포 도구 없이 GitHub 저장소의 gh-pages 브랜치에 push만 하면 자동으로 웹사이트를 배포할 수 있게 해줍니다. 또한, 복잡한 서버 설정 없이 HTML, CSS, JavaScript로 작성된 정적 파일을 호스팅할 수 있습니다."
      ],
      [
        "ver.2) HTML, CSS, JavaScript",
        "Chrome Extension을 통해 배포를 결정한 이후, 리액트를 사용하는 것에 많은 고민이 있었습니다. 하지만 리액트는 복잡한 상태 관리, 다중 컴포넌트 및 대규모 애플리케이션에 최적화되어 있지만 구현할 서비스는 그러한 기능이 없다고 판단했으며, 단순한 기능을 구현하는 데 복잡한 기술이 오히려 독이 될 수 있다고 생각했습니다."
      ],
      [
        "ver.2) Chrome Extension",
        "Github Pages를 배포하고 사용자 평가를 진행하는 도중, '크롬 익스텐션을 통해 배포를 진행하면 접근성이 좋아질 것 같다.'는 피드백을 받아, 브라우저의 기본 기능을 확장하고 사용자 경험을 개선하기 위해 버전 2에서는 크롬 익스텐션을 통해 배포를 진행했습니다."
      ]
    ]
  }
]
